anthropic.claude-code
anysphere.cursorpyright
anysphere.remote-ssh
astro-build.astro-vscode
bradlc.vscode-tailwindcss
bufbuild.vscode-buf
craigmaslowski.erb
dannymcgee.vscode-go-grammar
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
github.copilot
github.copilot-chat
github.remotehub
github.vscode-pull-request-github
golang.go
idleberg.applescript
idleberg.jxa
inferrinizzard.prettier-sql-vscode
jdinhlife.gruvbox
juanblanco.solidity
kamikillerto.vscode-colorize
luozhihao.call-graph
misogi.ruby-rubocop
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.isort
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.azure-repos
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
ms-vscode.remote-repositories
ms-vscode.vscode-typescript-next
ms-vsliveshare.vsliveshare
mtxr.sqltools
mtxr.sqltools-driver-pg
nomicfoundation.hardhat-solidity
prisma.prisma
redhat.java
rust-lang.rust-analyzer
shopify.ruby-lsp
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
techer.open-in-browser
tomphilbin.gruvbox-themes
twxs.cmake
usernamehw.errorlens
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscode-icons-team.vscode-icons
vscodevim.vim
wallabyjs.console-ninja
wayou.vscode-todo-highlight
yzhang.markdown-all-in-one
zxh404.vscode-proto3
